Autodesk.Revit.DB.RenderingSettings.SetRenderingQualitySettings(Autodesk.Revit.DB.RenderingQualitySettings)
Change rendering quality settings.
settings:
An instance of the new rendering quality settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.RenderingSettings.SetRenderingImageExposureSettings(Autodesk.Revit.DB.RenderingImageExposureSettings)
Changes the rendering image exposure settings.
exposure:
An instance of the new rendering image exposure settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.RenderingSettings.SetBackgroundSettings(Autodesk.Revit.DB.BackgroundSettings)
Changes the rendering background settings details for the current background style.
background:
An instance of the new rendering background settings.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013